АлогистикТест2/src/Documents/алк_АктИнвентаризацииПорт/алк_АктИнвентаризацииПорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_АктИнвентаризацииПорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оприходование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_АктИнвентаризацииПорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АктИнвентаризацииПортЗапасы.СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА &ВидДвиженияНакопленияРасход
		|		ИНАЧЕ &ВидДвиженияНакопленияПриход
		|	КОНЕЦ КАК ВидДвижения,
		|	&Период,
		|	алк_АктИнвентаризацииПортЗапасы.Номенклатура,
		|	алк_АктИнвентаризацииПортЗапасы.КоличествоПакетов,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Организация,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_АктИнвентаризацииПорт.Запасы КАК алк_АктИнвентаризацииПортЗапасы
		|ГДЕ
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА &ВидДвиженияНакопленияРасход
		|		ИНАЧЕ &ВидДвиженияНакопленияПриход
		|	КОНЕЦ КАК ВидДвижения,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Организация,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_АктИнвентаризацииПортЗапасы.Номенклатура,
		|	алк_АктИнвентаризацииПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_АктИнвентаризацииПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА алк_АктИнвентаризацииПортЗапасы.Списание
		|		ИНАЧЕ алк_АктИнвентаризацииПортЗапасы.Оприходование
		|	КОНЕЦ КАК Количество,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_АктИнвентаризацииПорт.Запасы КАК алк_АктИнвентаризацииПортЗапасы
		|ГДЕ
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[1].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли
